app/controllers/articles_controller.rb

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "articles" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "My edit"], ["description", "My article description"], ["updated_at", "2020-01-09 21:47:42.968090"], ["id", 1]]
---
  def update
    @article = Article.find(params[:id])
    input = params.require(:article).permit(:title, :description)
    @article.update(input)